cask_args appdir: "/Applications"

tap "arl/arl"
tap "candid82/brew"
tap "codefresh-io/cli"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/services"
tap "int128/kubelogin"
tap "universal-ctags/universal-ctags"

cask "alacritty"
cask "fanny"
cask "font-0xproto-nerd-font"
cask "hammerspoon"
cask "karabiner-elements"
cask "keycastr"
cask "slack"
cask "spotify"
cask "vivaldi"

brew "arl/arl/gitmux"
brew "bat"
brew "btop"
brew "candid82/brew/joker"
brew "cask"
brew "cheat"
brew "clojure"
brew "coreutils"
brew "diffutils"
brew "docker", link: false
brew "eza"
brew "fzf"
brew "gawk"
brew "git"
brew "git-delta"
brew "gnu-tar"
brew "gnu-which"
brew "gnutls"
brew "grep"
brew "helm"
brew "int128/kubelogin/kubelogin"
brew "java"
brew "java11"
brew "jq"
brew "k6"
brew "k9s"
brew "kafka"
brew "kcat"
brew "krew"
brew "kubectx"
brew "kubernetes-cli"
brew "leiningen"
brew "less"
brew "luarocks"
brew "make"
brew "mas"
brew "minikube"
brew "neovim"
brew "node", link: false
brew "openjdk@11"
brew "parallel"
brew "perl"
brew "pgcli"
brew "pipenv"
brew "postgresql@14"
brew "python-yq"
brew "python"
brew "python@3.12"
brew "reattach-to-user-namespace"
brew "redis"
brew "ripgrep"
brew "rust-analyzer"
brew "shellcheck"
brew "thefuck"
brew "tmux"
brew "tree"
brew "universal-ctags/universal-ctags/universal-ctags", args: ["HEAD"]
brew "universal-ctags", args: ["HEAD"]
brew "unzip"
brew "vim"
brew "watch"
brew "watchexec"
brew "wget"
brew "zsh"
brew "zsh-autocomplete"
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"
brew "zstd"

# App Store
mas "Amphetamine", id: 937984704
mas "Xcode", id: 497799835
